SOAP_XML_Folder/THS_MH.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v2="http://www.thig.com/webservices/policy/external/v2">
   <soapenv:Header>
      <v2:RequestHeader>
         <v2:ApiKey>6880c123d5dd4aaf96c9f8f91b4e0dab</v2:ApiKey>
      </v2:RequestHeader>
   </soapenv:Header>
   <soapenv:Body>
      <v2:MHRateRequest>
         <v2:PolicyTerm>
            <v2:Coverages>
               <v2:AllOtherPerilsDeductible>10000</v2:AllOtherPerilsDeductible>
               <v2:CoverageA>49063</v2:CoverageA>
               <v2:CoverageB>20000</v2:CoverageB>
               <v2:CoverageC>15000</v2:CoverageC>
               <v2:CoverageE>100000</v2:CoverageE>
               <v2:CoverageF>1000</v2:CoverageF>
               <!--Optional:-->
               <v2:WindHailDeductible>1000</v2:WindHailDeductible>
            </v2:Coverages>
            <v2:EffectiveDate>2020-05-25</v2:EffectiveDate>
            <!--Optional:-->
            <v2:Endorsements>
               <!--Optional:-->
               <v2:WaterDamage10AndFull>10pct</v2:WaterDamage10AndFull>
            </v2:Endorsements>
            <v2:Form>MC</v2:Form>
            <v2:Location>
               <v2:Address>
                  <v2:Street>5606 Willow Crest Dr</v2:Street>
                  <v2:City>Shreveport</v2:City>
                  <v2:State>LA</v2:State>
                  <v2:Zipcode>71119</v2:Zipcode>
               </v2:Address>
               <v2:ConstructionYear>2000</v2:ConstructionYear>
               <v2:DwellingSettlementType>RC</v2:DwellingSettlementType>
               <!--Optional:-->
               <v2:MHAdvantageChoiceHome>CHOICEHome</v2:MHAdvantageChoiceHome>
               <!--Optional:-->
               <v2:MobileHomeType>Multi</v2:MobileHomeType>
               <!--Optional:-->
               <v2:MonthsUnoccupied>1</v2:MonthsUnoccupied>
               <v2:NearFireHydrant>true</v2:NearFireHydrant>
               <v2:Occupancy>Seasonal</v2:Occupancy>
               <v2:OccupiedBy>Owner</v2:OccupiedBy>
               <!--Optional:-->
               <v2:ParkStatus>PrivateProperty</v2:ParkStatus>
               <v2:RoofYear>2000</v2:RoofYear>
            </v2:Location>
            <v2:PersonalPropertyReplacementCost>true</v2:PersonalPropertyReplacementCost>
            <v2:PrimaryInsured>
               <!--Optional:-->
               <v2:InsuranceScore>Good</v2:InsuranceScore>
               <v2:FirstName>Test</v2:FirstName>
               <v2:LastName>MH LA</v2:LastName>
               <v2:DateOfBirth>1982-10-12</v2:DateOfBirth>
            </v2:PrimaryInsured>
            <v2:Underwriting>
               <!--Optional:-->
               <v2:NewPurchase>true</v2:NewPurchase>
               <!--Optional:-->
               <v2:PriorPolicyExpirationDate>2019-09-09</v2:PriorPolicyExpirationDate>
               <v2:SquareFootage>1000</v2:SquareFootage>
            </v2:Underwriting>
            <v2:WindstormHailExclusion>false</v2:WindstormHailExclusion>
         </v2:PolicyTerm>
         <v2:User>
            <v2:GroupId>TS0A00</v2:GroupId>
            <v2:UserId>Vdaru</v2:UserId>
            <v2:Password/>
         </v2:User>
      </v2:MHRateRequest>
   </soapenv:Body>
</soapenv:Envelope>